read_liberty -lib -ignore_miss_dir -setattr blackbox /usr/local/share/qflow/tech/osu018/osu018_stdcells.lib
read_verilog  /home/jcscheunemann/Work/NRISC-Aurora/Hardware-design/Testes/Testes_PC/NRISC_PC_ctrl.rtlnopwr.v

# High-level synthesis
synth -top NRISC_PC_ctrl
# Map register flops
dfflibmap -liberty /usr/local/share/qflow/tech/osu018/osu018_stdcells.lib
opt

# Map combinatorial cells, standard script
abc -exe /usr/local/share/qflow/bin/yosys-abc -liberty /usr/local/share/qflow/tech/osu018/osu018_stdcells.lib -script +strash;scorr;ifraig;retime,{D};strash;dch,-f;map,-M,1,{D}
flatten

clean -purge
# Output buffering
iopadmap -outpad BUFX2 A:Y -bits
# Cleanup
opt
clean
rename -enumerate
write_blif  -buf BUFX2 A Y NRISC_PC_ctrl_mapped.blif
stat
